In [2]:
import pandas as pd
india_weather =pd.DataFrame( {
    "city": ["mumbai", "delhi", "banglore"],
    "temperature":[32, 45, 30],
    "humidity":[80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [4]:
us_weather = pd.DataFrame({
    "city":["new york", "chicago", "orlando"],
    "temperature" : [21, 14, 35],
    "humidity":[68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
# Now we are going to join this two data frame
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
# we can also change index 
df = pd.concat([india_weather, us_weather], ignore_index= True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [8]:
# we can also make a group inside the whole table and give them a key, so that whenever we call the key we get our table 
df = pd.concat([india_weather, us_weather], keys = ["india", "us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [10]:
# df.loc["india"]
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
#--------------------------------------new data frame --------------------------------

In [11]:
# now we are going to insert/append our one table just on the side of the existing table
temperature_df = pd.DataFrame({
    "city":["mumbai", "delhi", "bangalore"],
    "temperature":[32, 45, 30],
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [19]:
windspeed_df = pd.DataFrame({
    "city":["mumbai", "delhi", "bangalore"],
    "windspeed":[7, 12, 9],
}, index=[0, 1,2])
windspeed_df

        city  windspeed
0     mumbai          7
1      delhi         12
2  bangalore          9

In [13]:
# this will do the normal Concat
df = pd.concat([temperature_df, windspeed_df])
df

        city  temperature  windspeed
0     mumbai         32.0        NaN
1      delhi         45.0        NaN
2  bangalore         30.0        NaN
0     mumbai          NaN        7.0
1      delhi          NaN       12.0
2  bangalore          NaN        9.0

In [14]:
# here it come side by side 
df = pd.concat([temperature_df, windspeed_df], axis = 1)
df

        city  temperature       city  windspeed
0     mumbai           32     mumbai          7
1      delhi           45      delhi         12
2  bangalore           30  bangalore          9

In [21]:
# But the data is not always in order
# what if -
# now we are going to insert/append our one table just on the side of the existing table
temperature_df1 = pd.DataFrame({
    "city":["delhi", "mumbai"],
    "temperature":[32, 45],
},index=[1, 0])
temperature_df1

     city  temperature
1   delhi           32
0  mumbai           45

In [22]:
df = pd.concat([temperature_df1, windspeed_df], axis = 1)
df

     city  temperature       city  windspeed
1   delhi         32.0      delhi         12
0  mumbai         45.0     mumbai          7
2     NaN          NaN  bangalore          9

In [ ]:
# we use a funtion know as index which will help us to arrage the data in order

In [23]:
# we can also incert on col 
s = pd.Series(["Humid", "Dry", "Rain"], name = "event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [24]:
df = pd.concat([temperature_df, s], axis=1)
df

     city  temperature  event
0   delhi         32.0  Humid
1  mumbai         45.0    Dry
2     NaN          NaN   Rain